// Task_1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include "pch.h"
#include <iostream>

using namespace std;
/* На вход программе через стандартный ввод передаются два целых числа, по модулю не превышающие 100000.
 * Выведите в стандартный вывод их сумму.
 */
int main()
{
	int a, b;

	cin >> a >> b;
	cout << a + b << endl;

	return 0;
}
