// Task_7.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

/*
Дополните класс Person из задачи «Имена и фамилии — 2» конструктором,
	позволяющим задать имя и фамилию человека при рождении, а также сам год рождения.
Класс не должен иметь конструктора по умолчанию.

При получении на вход года, который меньше года рождения:
* методы GetFullName и GetFullNameWithHistory должны отдавать "No person";
* методы ChangeFirstName и ChangeLastName должны игнорировать запрос.

Кроме того, необходимо объявить константными все методы, которые по сути ими являются.
*/
#include <iostream>

int main()
{
    std::cout << "Hello World!\n"; 
}

